/**
 *@Time  2018/8/8 9:49
 *@Author  沐沐
 *@Description  1.let
 *                  作用：与var类似，用于声明一个变量
 *                  特点：
 *                      在块级作用域内有效
 *                      不能重复声明
 *                      不会预处理，不存在变量提升
*                      （预处理又叫做预解析，找两个东西[var(声明并赋值)， function]）
*                   应用：循环，遍历，监听
 *                       ---回调函数又叫做钩子函数
 *                       ---使用let取代var是趋势
 *             2.const
 *                   作用：定义一个常量
 *                   特点：
 *                   不能修改，其他特点同let
 *                   应用：
 *                   保存不用改变的数据
 *@return
 **/
